qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F0/stm32f0xx_hal_cec.h
/** @defgroup CEC_LBPEErrorBitGen   Error Bit Generation if Long Bit Period Error reported
  * @{
  */ 
#define CEC_LBPE_ERRORBIT_NO_GENERATION     ((uint32_t)0x00000000)
#define CEC_LBPE_ERRORBIT_GENERATION        ((uint32_t)CEC_CFGR_LBPEGEN)
#define IS_CEC_LBPEERRORBITGEN(ERRORBITGEN) (((ERRORBITGEN) == CEC_LBPE_ERRORBIT_NO_GENERATION) || \
                                             ((ERRORBITGEN) == CEC_LBPE_ERRORBIT_GENERATION))
/**
  * @}
  */    

/** @defgroup CEC_BroadCastMsgErrorBitGen   Error Bit Generation on Broadcast message
  * @{
  */ 
#define CEC_BROADCASTERROR_ERRORBIT_GENERATION     ((uint32_t)0x00000000)
#define CEC_BROADCASTERROR_NO_ERRORBIT_GENERATION  ((uint32_t)CEC_CFGR_BRDNOGEN)
#define IS_CEC_BROADCASTERROR_NO_ERRORBIT_GENERATION(ERRORBITGEN) (((ERRORBITGEN) == CEC_BROADCASTERROR_ERRORBIT_GENERATION) || \
                                                                   ((ERRORBITGEN) == CEC_BROADCASTERROR_NO_ERRORBIT_GENERATION))
/**
  * @}
  */
  
/** @defgroup CEC_SFT_Option         Signal Free Time start option
  * @{
  */ 
#define CEC_SFT_START_ON_TXSOM           ((uint32_t)0x00000000)
#define CEC_SFT_START_ON_TX_RX_END       ((uint32_t)CEC_CFGR_SFTOPT)
#define IS_CEC_SFTOP(SFTOP)              (((SFTOP) == CEC_SFT_START_ON_TXSOM) || \
                                          ((SFTOP) == CEC_SFT_START_ON_TX_RX_END))
/**
  * @}
  */
  
/** @defgroup CEC_Listening_Mode        Listening mode option
  * @{
  */ 
#define CEC_REDUCED_LISTENING_MODE          ((uint32_t)0x00000000)
#define CEC_FULL_LISTENING_MODE             ((uint32_t)CEC_CFGR_LSTN)
#define IS_CEC_LISTENING_MODE(MODE)         (((MODE) == CEC_REDUCED_LISTENING_MODE) || \
                                             ((MODE) == CEC_FULL_LISTENING_MODE))
/**
  * @}
  */

/** @defgroup CEC_ALL_ERROR all RX or TX errors flags in CEC ISR register 
  * @{
  */
#define CEC_ISR_ALL_ERROR              ((uint32_t)CEC_ISR_RXOVR|CEC_ISR_BRE|CEC_ISR_SBPE|CEC_ISR_LBPE|CEC_ISR_RXACKE|\
                                                  CEC_ISR_ARBLST|CEC_ISR_TXUDR|CEC_ISR_TXERR|CEC_ISR_TXACKE)
/**
  * @}
  */

/** @defgroup CEC_IER_ALL_RX all RX errors interrupts enabling flag 
  * @{
  */
#define CEC_IER_RX_ALL_ERR              ((uint32_t)CEC_IER_RXACKEIE|CEC_IER_LBPEIE|CEC_IER_SBPEIE|CEC_IER_BREIE|CEC_IER_RXOVRIE)
/**
  * @}
  */
  
/** @defgroup CEC_IER_ALL_TX all TX errors interrupts enabling flag 
  * @{
  */
#define CEC_IER_TX_ALL_ERR              ((uint32_t)CEC_IER_TXACKEIE|CEC_IER_TXERRIE|CEC_IER_TXUDRIE|CEC_IER_ARBLSTIE)
/**
  * @}
  */  
  
/** @defgroup CEC_OAR_Position    Device Own Address position in CEC CFGR register     
  * @{
  */
#define CEC_CFGR_OAR_LSB_POS            ((uint32_t) 16)
/**
  * @}
  */
  
/** @defgroup CEC_Initiator_Position    Initiator logical address position in message header     
  * @{
  */
#define CEC_INITIATOR_LSB_POS           ((uint32_t) 4)
/**
  * @}
  */
  
/**
  * @}
  */  
  
/* Exported macros -----------------------------------------------------------*/
/** @defgroup CEC_Exported_Macros CEC Exported Macros
  * @{
  */

/** @brief  Reset CEC handle state
  * @param  __HANDLE__: CEC handle.
  * @retval None
  */
#define __HAL_CEC_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_CEC_STATE_RESET)

/** @brief  Checks whether or not the specified CEC interrupt flag is set.
  * @param  __HANDLE__: specifies the CEC Handle.
  * @param  __INTERRUPT__: specifies the interrupt to check.
  *        This parameter can be one of the following values:
  *            @arg CEC_ISR_RXBR      : Rx-Byte Received
  *            @arg CEC_ISR_RXEND     : End of Reception
  *            @arg CEC_ISR_RXOVR     : Rx Overrun
  *            @arg CEC_ISR_BRE       : Rx Bit Rising Error
  *            @arg CEC_ISR_SBPE      : Rx Short Bit Period Error
  *            @arg CEC_ISR_LBPE      : Rx Long Bit Period Error
  *            @arg CEC_ISR_RXACKE    : Rx Missing Acknowledge
  *            @arg CEC_ISR_ARBLST    : Arbitration lost
  *            @arg CEC_ISR_TXBR      : Tx-Byte Request
  *            @arg CEC_ISR_TXEND     : End of Transmission   
  *            @arg CEC_ISR_TXUDR     : Tx-buffer Underrun                  
  *            @arg CEC_ISR_TXERR     : Tx Error
  *            @arg CEC_ISR_TXACKE    : Tx Missing Acknowledge
  * @retval ITStatus
  */
#define __HAL_CEC_GET_IT(__HANDLE__, __INTERRUPT__)        ((__HANDLE__)->Instance->ISR & (__INTERRUPT__)) 

/** @brief  Clears the interrupt or status flag when raised (write at 1)
  * @param  __HANDLE__: specifies the CEC Handle.
  * @param  __FLAG__: specifies the interrupt/status flag to clear.
  *        This parameter can be one of the following values:
  *            @arg CEC_ISR_RXBR      : Rx-Byte Received
  *            @arg CEC_ISR_RXEND     : End of Reception
  *            @arg CEC_ISR_RXOVR     : Rx Overrun
  *            @arg CEC_ISR_BRE       : Rx Bit Rising Error
  *            @arg CEC_ISR_SBPE      : Rx Short Bit Period Error
  *            @arg CEC_ISR_LBPE      : Rx Long Bit Period Error
  *            @arg CEC_ISR_RXACKE    : Rx Missing Acknowledge
  *            @arg CEC_ISR_ARBLST    : Arbitration lost
  *            @arg CEC_ISR_TXBR      : Tx-Byte Request
  *            @arg CEC_ISR_TXEND     : End of Transmission   
  *            @arg CEC_ISR_TXUDR     : Tx-buffer Underrun                  
  *            @arg CEC_ISR_TXERR     : Tx Error
  *            @arg CEC_ISR_TXACKE    : Tx Missing Acknowledge
  * @retval none  
  */
#define __HAL_CEC_CLEAR_FLAG(__HANDLE__, __FLAG__)         ((__HANDLE__)->Instance->ISR = (__FLAG__)) 

/** @brief  Enables the specified CEC interrupt.
  * @param  __HANDLE__: specifies the CEC Handle.
  * @param  __INTERRUPT__: specifies the CEC interrupt to enable.
  *          This parameter can be one of the following values:
  *            @arg CEC_IER_RXBRIE         : Rx-Byte Received IT Enable         
  *            @arg CEC_IER_RXENDIE        : End Of Reception IT Enable         
  *            @arg CEC_IER_RXOVRIE        : Rx-Overrun IT Enable               
  *            @arg CEC_IER_BREIE          : Rx Bit Rising Error IT Enable      
  *            @arg CEC_IER_SBPEIE         : Rx Short Bit period Error IT Enable
  *            @arg CEC_IER_LBPEIE         : Rx Long Bit period Error IT Enable 
  *            @arg CEC_IER_RXACKEIE       : Rx Missing Acknowledge IT Enable   
  *            @arg CEC_IER_ARBLSTIE       : Arbitration Lost IT Enable         
  *            @arg CEC_IER_TXBRIE         : Tx Byte Request IT Enable         
  *            @arg CEC_IER_TXENDIE        : End of Transmission IT Enable      
  *            @arg CEC_IER_TXUDRIE        : Tx-Buffer Underrun IT Enable       
  *            @arg CEC_IER_TXERRIE        : Tx-Error IT Enable                 
  *            @arg CEC_IER_TXACKEIE       : Tx Missing Acknowledge IT Enable                   
  * @retval none
  */
#define __HAL_CEC_ENABLE_IT(__HANDLE__, __INTERRUPT__)     ((__HANDLE__)->Instance->IER |= (__INTERRUPT__))  

/** @brief  Disables the specified CEC interrupt.
  * @param  __HANDLE__: specifies the CEC Handle.
  * @param  __INTERRUPT__: specifies the CEC interrupt to disable.
  *          This parameter can be one of the following values:
  *            @arg CEC_IER_RXBRIE         : Rx-Byte Received IT Enable         
  *            @arg CEC_IER_RXENDIE        : End Of Reception IT Enable         
  *            @arg CEC_IER_RXOVRIE        : Rx-Overrun IT Enable               
  *            @arg CEC_IER_BREIE          : Rx Bit Rising Error IT Enable      
  *            @arg CEC_IER_SBPEIE         : Rx Short Bit period Error IT Enable
  *            @arg CEC_IER_LBPEIE         : Rx Long Bit period Error IT Enable 
  *            @arg CEC_IER_RXACKEIE       : Rx Missing Acknowledge IT Enable   
  *            @arg CEC_IER_ARBLSTIE       : Arbitration Lost IT Enable         
  *            @arg CEC_IER_TXBRIE         : Tx Byte Request IT Enable         
  *            @arg CEC_IER_TXENDIE        : End of Transmission IT Enable      
  *            @arg CEC_IER_TXUDRIE        : Tx-Buffer Underrun IT Enable       
  *            @arg CEC_IER_TXERRIE        : Tx-Error IT Enable                 
  *            @arg CEC_IER_TXACKEIE       : Tx Missing Acknowledge IT Enable                   
  * @retval none
  */   
#define __HAL_CEC_DISABLE_IT(__HANDLE__, __INTERRUPT__)    ((__HANDLE__)->Instance->IER &= (~(__INTERRUPT__)))  

